# IncludeThermalProperties Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..IncludeThermalProperties Property
EnergyDataSettings Class See Also
---
Indicates if thermal information from model assemblies and components is included in GreenBuildingXML export of the detailed model.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IncludeThermalProperties { get; set; }
```

Visual Basic
---
```text
Public Property IncludeThermalProperties As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IncludeThermalProperties {
	bool get ();
	void set (bool value);
}
```

# Remarks
If true, Revit will include model thermal data from assemblies and components when available, when Export Category is Rooms.
# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace